IlleniumDillon/MM32F5277/MM32/MM32_FLEXCAN1Regdef.h
#ifndef _MM32_FLEXCAN1REGDEF_H_
#define _MM32_FLEXCAN1REGDEF_H_

#include "MM32_RegTypedef.h"
//Module configuration register
typedef struct
{
	Strict_32Bit MAXMB			:7;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit IDAM			:2;
	Strict_32Bit _reserved_1			:3;
	Strict_32Bit LPRIOEN			:1;
	Strict_32Bit _reserved_2			:1;
	Strict_32Bit DMA			:1;
	Strict_32Bit IRMQ			:1;
	Strict_32Bit SRXDIS			:1;
	Strict_32Bit _reserved_3			:1;
	Strict_32Bit WAKSRC			:1;
	Strict_32Bit LPMACK			:1;
	Strict_32Bit WRNEN			:1;
	Strict_32Bit SLFWAK			:1;
	Strict_32Bit SUPV			:1;
	Strict_32Bit FRZACK			:1;
	Strict_32Bit SOFTRST			:1;
	Strict_32Bit _reserved_4			:1;
	Strict_32Bit NOTRDY			:1;
	Strict_32Bit HALT			:1;
	Strict_32Bit RFEN			:1;
	Strict_32Bit FRZ			:1;
	Strict_32Bit MDIS			:1;
}MM32_FLEXCAN1_MCRBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_MCRBits B;
}MM32_FLEXCAN1_MCR;

//Control 1 register
typedef struct
{
	Strict_32Bit PROPSEG			:3;
	Strict_32Bit LOM			:1;
	Strict_32Bit LBUF			:1;
	Strict_32Bit TSYN			:1;
	Strict_32Bit BOFFREC			:1;
	Strict_32Bit SMP			:1;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit RWRNMSK			:1;
	Strict_32Bit TWRNMSK			:1;
	Strict_32Bit LPB			:1;
	Strict_32Bit CLKSRC			:1;
	Strict_32Bit ERRMSK			:1;
	Strict_32Bit BOFFMSK			:1;
	Strict_32Bit PSEG2			:3;
	Strict_32Bit PSEG1			:3;
	Strict_32Bit RJW			:2;
	Strict_32Bit PRESDIV			:8;
}MM32_FLEXCAN1_CTRL1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CTRL1Bits B;
}MM32_FLEXCAN1_CTRL1;

//Free running timer register
typedef struct
{
	Strict_32Bit TIMER			:16;
	Strict_32Bit _reserved_0			:16;
}MM32_FLEXCAN1_TIMERBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_TIMERBits B;
}MM32_FLEXCAN1_TIMER;

//  Rx mailbox global mask register
typedef struct
{
	Strict_32Bit MG			:32;
}MM32_FLEXCAN1_RXMGMASKBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_RXMGMASKBits B;
}MM32_FLEXCAN1_RXMGMASK;

//  Rx 14 mask register
typedef struct
{
	Strict_32Bit RX14M			:32;
}MM32_FLEXCAN1_RX14MASKBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_RX14MASKBits B;
}MM32_FLEXCAN1_RX14MASK;

//  Rx 15 mask register
typedef struct
{
	Strict_32Bit RX15M			:32;
}MM32_FLEXCAN1_RX15MASKBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_RX15MASKBits B;
}MM32_FLEXCAN1_RX15MASK;

//  Error count register
typedef struct
{
	Strict_32Bit TXERRCNT			:8;
	Strict_32Bit RXERRCNT			:8;
	Strict_32Bit _reserved_0			:16;
}MM32_FLEXCAN1_ECRBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ECRBits B;
}MM32_FLEXCAN1_ECR;

//  Error and status 1 register
typedef struct
{
	Strict_32Bit WAKINT			:1;
	Strict_32Bit ERRINT			:1;
	Strict_32Bit BOFFINT			:1;
	Strict_32Bit RX			:1;
	Strict_32Bit FLTCONF			:2;
	Strict_32Bit TX			:1;
	Strict_32Bit IDLE			:1;
	Strict_32Bit RXWRN			:1;
	Strict_32Bit TXWRN			:1;
	Strict_32Bit STFERR			:1;
	Strict_32Bit FRMERR			:1;
	Strict_32Bit CRCERR			:1;
	Strict_32Bit ACKERR			:1;
	Strict_32Bit BIT0ERR			:1;
	Strict_32Bit BIT1ERR			:1;
	Strict_32Bit RWRNINT			:1;
	Strict_32Bit TWRNINT			:1;
	Strict_32Bit SYNCH			:1;
	Strict_32Bit BOFFDONEINT			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit ERROVR			:1;
	Strict_32Bit _reserved_1			:10;
}MM32_FLEXCAN1_ESR1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ESR1Bits B;
}MM32_FLEXCAN1_ESR1;

//  Interrupt mask 1 register
typedef struct
{
	Strict_32Bit BUF15TO0M			:16;
	Strict_32Bit _reserved_0			:16;
}MM32_FLEXCAN1_IMASK1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_IMASK1Bits B;
}MM32_FLEXCAN1_IMASK1;

//  Interrupt flag 1 register
typedef struct
{
	Strict_32Bit BUF0I			:1;
	Strict_32Bit BUF4TO1I			:4;
	Strict_32Bit BUF5I			:1;
	Strict_32Bit BUF6I			:1;
	Strict_32Bit BUF7I			:1;
	Strict_32Bit BUF15TO8I			:8;
	Strict_32Bit _reserved_0			:16;
}MM32_FLEXCAN1_IFLAG1Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_IFLAG1Bits B;
}MM32_FLEXCAN1_IFLAG1;

//  Control 2 register
typedef struct
{
	Strict_32Bit _reserved_0			:16;
	Strict_32Bit EACEN			:1;
	Strict_32Bit RRS			:1;
	Strict_32Bit MRP			:1;
	Strict_32Bit TASD			:5;
	Strict_32Bit RFFN			:4;
	Strict_32Bit _reserved_1			:2;
	Strict_32Bit BOFFDONEMSK			:1;
	Strict_32Bit _reserved_2			:1;
}MM32_FLEXCAN1_CTRL2Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CTRL2Bits B;
}MM32_FLEXCAN1_CTRL2;

//  Error and status 2 register
typedef struct
{
	Strict_32Bit _reserved_0			:13;
	Strict_32Bit IMB			:1;
	Strict_32Bit VPS			:1;
	Strict_32Bit _reserved_1			:1;
	Strict_32Bit LPTM			:7;
	Strict_32Bit _reserved_2			:9;
}MM32_FLEXCAN1_ESR2Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ESR2Bits B;
}MM32_FLEXCAN1_ESR2;

//  CRC register
typedef struct
{
	Strict_32Bit TXCRC			:15;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit MBCRC			:7;
	Strict_32Bit _reserved_1			:9;
}MM32_FLEXCAN1_CRCRBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CRCRBits B;
}MM32_FLEXCAN1_CRCR;

//  Rx FIFO global mask register
typedef struct
{
	Strict_32Bit FGM			:32;
}MM32_FLEXCAN1_RXFGMASKBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_RXFGMASKBits B;
}MM32_FLEXCAN1_RXFGMASK;

//  Rx FIFO information register
typedef struct
{
	Strict_32Bit IDHIT			:9;
	Strict_32Bit _reserved_0			:23;
}MM32_FLEXCAN1_RXFIRBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_RXFIRBits B;
}MM32_FLEXCAN1_RXFIR;

//  CAN bit timing register
typedef struct
{
	Strict_32Bit EPSEG2			:5;
	Strict_32Bit EPSEG1			:5;
	Strict_32Bit EPROPSEG			:6;
	Strict_32Bit ERJW			:5;
	Strict_32Bit EPRESDIV			:10;
	Strict_32Bit BTF			:1;
}MM32_FLEXCAN1_CBTBits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CBTBits B;
}MM32_FLEXCAN1_CBT;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN1_CS0Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CS0Bits B;
}MM32_FLEXCAN1_CS0;

