IlleniumDillon/MM32F5277/MM32/MM32_FLEXCAN1Regdef.h
// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN1_ID9Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ID9Bits B;
}MM32_FLEXCAN1_ID9;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN1_WORD09Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD09Bits B;
}MM32_FLEXCAN1_WORD09;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN1_WORD19Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD19Bits B;
}MM32_FLEXCAN1_WORD19;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN1_CS10Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CS10Bits B;
}MM32_FLEXCAN1_CS10;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN1_ID10Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ID10Bits B;
}MM32_FLEXCAN1_ID10;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN1_WORD010Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD010Bits B;
}MM32_FLEXCAN1_WORD010;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN1_WORD110Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD110Bits B;
}MM32_FLEXCAN1_WORD110;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN1_CS11Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CS11Bits B;
}MM32_FLEXCAN1_CS11;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN1_ID11Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ID11Bits B;
}MM32_FLEXCAN1_ID11;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN1_WORD011Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD011Bits B;
}MM32_FLEXCAN1_WORD011;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN1_WORD111Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD111Bits B;
}MM32_FLEXCAN1_WORD111;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN1_CS12Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CS12Bits B;
}MM32_FLEXCAN1_CS12;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN1_ID12Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ID12Bits B;
}MM32_FLEXCAN1_ID12;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN1_WORD012Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD012Bits B;
}MM32_FLEXCAN1_WORD012;

// Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register
typedef struct
{
	Strict_32Bit BYTE7			:8;
	Strict_32Bit BYTE6			:8;
	Strict_32Bit BYTE5			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE4			:8;
}MM32_FLEXCAN1_WORD112Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD112Bits B;
}MM32_FLEXCAN1_WORD112;

// Message Buffer 0 CS Register..Message Buffer 15 CS Register
typedef struct
{
	Strict_32Bit TIMESTAMP			:16;
	Strict_32Bit DLC			:4;
	Strict_32Bit RTR			:1;
	Strict_32Bit IDE			:1;
	Strict_32Bit SRR			:1;
	Strict_32Bit _reserved_0			:1;
	Strict_32Bit CODE			:4;
	Strict_32Bit _reserved_1			:4;
}MM32_FLEXCAN1_CS13Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_CS13Bits B;
}MM32_FLEXCAN1_CS13;

// Message Buffer 0 ID Register..Message Buffer 15 ID Register
typedef struct
{
	Strict_32Bit EXT			:18;
	Strict_32Bit STD			:11;
	Strict_32Bit PRIO			:3;
}MM32_FLEXCAN1_ID13Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_ID13Bits B;
}MM32_FLEXCAN1_ID13;

// Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register
typedef struct
{
	Strict_32Bit BYTE3			:8;
	Strict_32Bit BYTE2			:8;
	Strict_32Bit BYTE1			:6;
	Strict_32Bit _reserved_0			:2;
	Strict_32Bit BYTE0			:8;
}MM32_FLEXCAN1_WORD013Bits;

typedef union
{
	int32_t I;
	uint32_t U;
	MM32_FLEXCAN1_WORD013Bits B;
}MM32_FLEXCAN1_WORD013;

